{
    "FC01": "Function không tồn tại trong Hệ Thống.",
    "FC02": "Name đã tồn tại trong Hệ Thống.",
    "FC03": "Name hoặc GroupName đã tồn tại trong Hệ Thống",
    "FC04": "Name không được phép để trống.",
    "FC05": "GroupName không được phép để trống.",
    "FC06": "GroupName không được quá 50 ký tự.",
    "FC07": "ActionName không được quá 200 ký tự.",
    "FC08": "ControllerName không được quá 200 ký tự.",
    "FC09": "Area không được quá 200 ký tự.",
    "FC10": "Notes không được quá 1000 ký tự.",
    "FC11": "CssClass không được quá 100 ký tự.",
    "FC12": "CssBadge không được quá 50 ký tự.",
    "FC13": "ParentId không tồn tại trong Hệ Thống.",

    "AC01": "ActionName không được quá 200 ký tự.",
    "AC02": "ActionName không được phép để trống.",
    "AC03": "ControllerName không được quá 200 ký tự.",
    "AC04": "Ghi chú không được quá 200 ký tự.",
    "AC05": "Name không được quá 200 ký tự.",
    "AC06": "ActionType không hợp lệ.",
    "AC07": "Action không tồn tại trong Hệ Thống.",
    "AC08": "FunctionId không tồn tại trong Hệ Thống.",

    "UC01": "FirstName không được quá 100 ký tự.",
    "UC02": "Tên không được quá 500 ký tự.",
    "UC03": "Tài khoản không được quá 50 ký tự.",
    "UC04": "Email không được quá 200 ký tự",
    "UC05": "Số điện thoại không được quá 50 ký tự",
    "UC06": "Địa chỉ không được quá 500 ký tự",
    "UC07": "PasswordHash không được quá 100 ký tự",
    "UC08": "Số điện thoại không được quá 200 ký tự",
    "UC09": "Mật khẩu mới và xác nhận mật khẩu phải giống nhau.",
    "UC10": "Nhóm người dùng không được quá 50 ký tự",
    "UC11": "Tên không được để trống",
    "UC12": "Tên không được để trống",
    "UC13": "Tài khoản không được để trống",
    "UC14": "Mật khẩu không được bỏ trống",
    "UC15": "Email không đúng định dạng.",
    "UC16": "Email đã tồn tại trong Hệ Thống.",
    "UC17": "Số điện thoại đã tồn tại trong Hệ Thống.",
    "UC18": "Số điện thoại đã tồn tại trong Hệ Thống.",
    "UC19": "Tài khoản đã tồn tại trong Hệ Thống.",
    "UC20": "Nhóm người dùng không tồn tại trong Hệ Thống",
    "UC21": "Người dùng không tồn tại trong Hệ Thống.",
    "UC22": "Nhóm người dùng đã tồn tại trong Hệ Thống",
    "UC23": "Không thể cập nhật thông tin User vào nhóm người dùng.",
    "UC24": "Mật khẩu không chính xác.",
    "UC25": "Phiên làm việc của bạn đã hết hạn, vui lòng đăng nhập lại vào hệ thống.",
    "UC26": "Phiên làm việc của bạn đã hết hạn, vui lòng đăng nhập lại vào hệ thống.",
    "UC27": "Đường dẫn hình ảnh không vượt quá 200 ký tự.",
    "UC28": "Phiên làm việc của bạn đã hết hạn, vui lòng đăng nhập lại vào hệ thống.",
    "UC29": "UserName bị trùng trong Hệ Thống.",
    "UC30": "Nhân sự đã có tài khoản trong Hệ Thống.",
    "UC31": "Không thể đồng bộ nhân sự có tên tài khoản và mã nhân sự và email nội bộ không hợp lệ.",

    "QGC01": "Mã quốc gia không được vượt quá 20 ký tự",
    "QGC02": "Tên quốc gia không được vượt quá 200 ký tự",
    "QGC03": "Quốc gia không tồn tại trong Hệ Thống.",

    "TTC01": "Mã tỉnh thành không được vượt quá 20 ký tự",
    "TTC02": "Tên tỉnh thành không được vượt quá 200 ký tự",
    "TTC03": "Tỉnh thành không tồn tại trong Hệ Thống.",

    "QHC01": "Mã quận huyện không được vượt quá 20 ký tự",
    "QHC02": "Tên quận huyện không được vượt quá 200 ký tự",
    "QHC03": "Quận huyện không tồn tại trong Hệ Thống.",

    "PXC01": "Mã phường xã không được vượt quá 20 ký tự",
    "PXC02": "Tên phường xã không được vượt quá 200 ký tự",
    "PXC03": "Phường xã không tồn tại trong Hệ Thống.",

    "KCQC01": "Mã khối cơ quan không được vượt quá 20 ký tự",
    "KCQC02": "Tên khối cơ quan không được vượt quá 200 ký tự",
    "KCQC03": "Khối cơ quan không tồn tại trong Hệ Thống.",

    "CQC01": "Mã cơ quan không được vượt quá 20 ký tự",
    "CQC02": "Tên cơ quan không được vượt quá 200 ký tự",
    "CQC03": "Cơ quan không tồn tại trong Hệ Thống.",
    "CQC04": "Tên viết tắt không được vượt quá 200 ký tự",
    "CQC05": "Địa chỉ không được vượt quá 200 ký tự",
    "CQC06": "Số điện thoại không được vượt quá 200 ký tự",
    "CQC07": "Số fax không được vượt quá 200 ký tự",
    "CQC08": "Email liên hệ không được vượt quá 200 ký tự",
    "CQC09": "Website không được vượt quá 200 ký tự",
    "CQC10": "WebsiteKHCN không được vượt quá 200 ký tự",
    "CQC11": "Giới thiệu tổ chức không được vượt quá 200 ký tự",

    "NNC01": "Mã ngoại ngữ không được vượt quá 20 ký tự",
    "NNC02": "Tên ngoại ngữ không được vượt quá 200 ký tự",
    "NNC03": "Ngoại ngữ không tồn tại trong Hệ Thống.",
    "NNC04": "Tên ngoại ngữ không được phép để trống.",
    "NNC05": "Mã ngoại ngữ đã tồn tại trong hệ thống",
    "NNC06": "Ghi chú không được vượt quá 200 ký tự",
    "NNC07": "Mã ngoại ngữ không được phép để trống.",

    "TDNNC01": "Mã trình độ ngoại ngữ không được vượt quá 20 ký tự",
    "TDNNC02": "Tên trình độ ngoại ngữ không được vượt quá 200 ký tự",
    "TDNNC03": "Trình độ ngoại ngữ không tồn tại trong Hệ Thống.",
    "TDNNC04": "Tên trình độ ngoại ngữ không được phép để trống.",
    "TDNNC05": "Trình độ ngoại ngữ đã tồn tại trong hệ thống",
    "TDNNC06": "Ghi chú không được vượt quá 200 ký tự",
    "TDNNC07": "Mã trình độ ngoại ngữ không được phép để trống.",

    "TDVTC01": "Mã trình độ vi tính không được vượt quá 20 ký tự",
    "TDVTC02": "Tên trình độ vi tính không được vượt quá 200 ký tự",
    "TDVTC03": "Tên trình độ vi tính không được để trống",
    "TDVTC04": "Trình độ vi tính không tồn tại",
    "TDVTC05": "Mã trình độ vi đã tồn tại",

    "GC01": "Mã không được vượt quá 20 ký tự",
    "GC02": "Mã không được để trống.",
    "GC03": "Tên không được vượt quá 200 ký tự.",
    "GC04": "Ghi chú không được vượt quá 200 ký tự",
    "GC05": "Dữ liệu không tồn tại",
    "GC06": "Dữ liệu đang được sử dụng không được xóa.",
    "GC07": "Mã đã tồn tại trong hệ thống",
    "GC08": "Tên không được để trống.",
    "GC09": "Dữ liệu thêm vào không tồn tại khóa chính.",

    "TDVHC01": "Mã trình độ văn hóa không được vượt quá 20 ký tự",
    "TDVHC02": "Mã trình độ văn hóa không được bỏ trống",
    "TDVHC03": "Tên trình độ văn hóa không được vượt quá 200 ký tự",
    "TDVHC04": "Tên trình độ văn hóa không được bỏ trống",
    "TDVHC05": "Trình độ văn hóa không tồn tại trong Hệ Thống",
    "TDVHC06": "Ghi chú không được vượt quá 200 ký tự",
    "TDVHC07": "Mã trình độ văn hóa đã tồn tại",
    "TDVHC08": "Tên trình độ văn hóa đã tồn tại",

    "TDNNUOCC01": "Mã trình độ nhà nước không được vượt quá 20 ký tự",
    "TDNNUOCC02": "Mã trình độ nhà nước không được bỏ trống",
    "TDNNUOCC03": "Tên trình độ nhà nước không được vượt quá 200 ký tự",
    "TDNNUOCC04": "Tên trình độ nhà nước không được bỏ trống",
    "TDNNUOCC05": "Trình độ nhà nước không tồn tại trong Hệ Thống",
    "TDNNUOCC06": "Ghi chú không được vượt quá 200 ký tự",
    "TDNNUOCC07": "Mã trình độ nhà nước đã tồn tại",
    "TDNNUOCC08": "Tên trình độ nhà nước đã tồn tại",

    "DTCSC01": "Mã đối tượng chính sách không được vượt quá 20 ký tự",
    "DTCSC02": "Mã đối tượng chính sách không được bỏ trống",
    "DTCSC03": "Tên đối tượng chính sách không được vượt quá 200 ký tự",
    "DTCSC04": "Tên đối tượng chính sách không được bỏ trống",
    "DTCSC05": "Đối tượng chính sách không tồn tại trong Hệ Thống",
    "DTCSC06": "Ghi chú không được vượt quá 200 ký tự",
    "DTCSC07": "Mã đối tượng chính sách đã tồn tại",

    "QHGDC01": "Mã quan hệ gia đình không được vượt quá 20 ký tự",
    "QHGDC02": "Mã quan hệ gia đình không được bỏ trống",
    "QHGDC03": "Tên quan hệ gia đình không được vượt quá 200 ký tự",
    "QHGDC04": "Tên quan hệ gia đình không được bỏ trống",
    "QHGDC05": "Quan hệ gia đình không tồn tại trong Hệ Thống",
    "QHGDC06": "Ghi chú không được vượt quá 200 ký tự",
    "QHGDC07": "Mã quan hệ gia đình đã tồn tại",
    "QHGDC08": "Tên quan hệ gia đình đã tồn tại",

    "NCCC01": "Chức danh nghề nghiệp không tồn tại trong Hệ Thống.",

    "KhenThuongC01": "Mã khen thưởng không được vượt quá 20 ký tự",
    "KhenThuongC02": "Mã khen thưởng không được bỏ trống",
    "KhenThuongC03": "Tên khen thưởng không được vượt quá 200 ký tự",
    "KhenThuongC04": "Khen thưởng không tồn tại",
    "KhenThuongC05": "Khen thưởng đã tồn tại trong Hệ Thống",
    "KhenThuongC06": "Ghi chú không được vượt quá 200 ký tự",
    "KhenThuongC07": "Mã khen thưởng đã tồn tại",

    "TTHNC01": "Mã tình trạng hôn nhân không được vượt quá 20 ký tự",
    "TTHNC02": "Mã tình trạng hôn nhân không được bỏ trống",
    "TTHNC03": "Tên tình trạng hôn nhân không được vượt quá 200 ký tự",
    "TTHNC04": "Tình trạng hôn nhân không tồn tại",
    "TTHNC05": "Tình trạng hôn nhân đã tồn tại trong Hệ Thống",
    "TTHNC06": "Ghi chú không được vượt quá 200 ký tự",
    "TTHNC07": "Mã tình trạng hôn nhân đã tồn tại",

    "LHC01": "Nhóm hợp đồng không tồn tại trong Hệ Thống.",

    "NhomNgachC01": "Mã nhóm CDNN không được vượt quá 20 ký tự",
    "NhomNgachC02": "Mã nhóm CDNN không được bỏ trống",
    "NhomNgachC03": "Tên nhóm CDNN không được vượt quá 200 ký tự",
    "NhomNgachC04": "Nhóm CDNN không tồn tại",
    "NhomNgachC05": "Nhóm CDNN đã tồn tại trong Hệ Thống",
    "NhomNgachC06": "Ghi chú không được vượt quá 200 ký tự",
    "NhomNgachC07": "Mã nhóm CDNN đã tồn tại",

    "DTDGC01": "Mã đối tượng đánh giá không được vượt quá 20 ký tự",
    "DTDGC02": "Mã đối tượng đánh giá không được bỏ trống",
    "DTDGC03": "Tên đối tượng đánh giá không được vượt quá 200 ký tự",
    "DTDGC04": "Đối tượng đánh giá không tồn tại",
    "DTDGC05": "Đối tượng đánh giá đã tồn tại trong Hệ Thống",
    "DTDGC06": "Ghi chú không được vượt quá 200 ký tự",
    "DTDGC07": "Mã Đối tượng đánh giá đã tồn tại",

    "HTTLC01": "Đường dẫn không được vượt quá 200 ký tự",

    "DTTHC01": "Danh sách chức vụ không được vượt quá 200 ký tự",

    "PDGC01": "Mã phiếu vượt quá 20 ký tự",
    "PDGC02": "Tên phiếu vượt quá 200 ký tự",
    "PDGC03": "Ghi chú đầu trang vượt quá 4000 ký tự",
    "PDGC04": "Ghi chú cuối trang vượt quá 4000 ký tự",
    "PDGC05": "Ghi chú vượt quá 1000 ký tự",
    "PDGC06": "Mã phiếu không được phép không được để trống.",
    "PDGC07": "Tên phiếu không được phép không được để trống.",
    "PDGC08": "Phiếu đánh giá không tồn tại trong Hệ Thống.",
    "PDGC09": "Mã Phiếu đã tồn tại.",
    "PDGC10": "Phiếu đánh giá đã được sử dụng không được phép chỉnh sửa.",
    "PDGC11": "Phiếu đánh giá đã được sử dụng không được phép xóa.",

    "CHDGC01": "Nội dung câu hỏi vượt quá 4000 ký tự",
    "CHDGC02": "Ghi chú vượt quá 4000 ký tự",
    "CHDGC03": "Câu hỏi không tồn tại trong Hệ Thống.",
    "CHDGC04": "Nội dung câu hỏi không được phép không được để trống.",
    "CHDGC05": "Đối tượng thực hiện không được phép không được để trống.",
    "CHDGC06": "Hình thức trả lời không được phép không được để trống.",
    "CHDGC07": "Không tồn tại câu hỏi trong phiếu đánh giá",
    "CHDGC08": "Phải tồn tại 1 câu hỏi Xếp Loại trong nhóm",
    "CHDGC09": "Câu hỏi Xếp Loại đã tồn tại trong nhóm",
    "CHDGC10": "Câu hỏi trong phiểu đánh giá đã bị thay đổi vui lòng kiểm tra lại.",
    "CHDGC11": "Tiêu chí đánh giá vượt quá 4000 ký tự.",

    "DDGC01": "Tên đợt đánh giá vượt quá 200 ký tự",
    "DDGC02": "Ghi chú vượt quá 200 ký tự",
    "DDGC03": "Đợt đánh giá không tồn tại trong hệ thống",
    "DDGC04": "Phiếu đánh giá không tồn tại trong hệ thống",
    "DDGC05": "Quy không đúng định dạng",
    "DDGC06": "Đến ngày không được nhỏ hơn từ ngày.",
    "DDGC07": "Đợt đánh giá chi tiết không được để trống.",
    "DDGC08": "Năm không hợp lệ vui lòng kiểm tra lại.",
    "DDGC09": "Loại đánh giá không được không được để trống.",
    "DDGC10": "Tên đợt đánh giá không được không được để trống.",
    "DDGC11": "Từ ngày không được không được để trống.",
    "DDGC12": "Đến ngày không được không được để trống.",
    "DDGC13": "Đã phân công đánh giá cho nhân sự, vui lòng xóa danh sách nhân sự trước khi thực hiện xóa kỳ đánh giá",

    "NSDGCTC01": "Nhân sự đánh giá chi tiết không tồn tại",
    "NSDGCTC02": "Nhân sự đánh giá chi tiết đã tồn tại trong hệ thống.",
    "NSDGCTC03": "Nhân sự chưa tự đánh giá không được chuyển.",
    "NSDGCTC04": "Nhân sự đã được quản lý đánh giá không được gửi phiếu.",
    "NSDGCTC05": "Nhân sự chưa được ban quản lý đánh giá không thể duyệt.",

    "DDGCTC01": "Ghi chú vượt quá 200 ký tự",
    "DDGCTC02": "Đợt đánh giá chi tiết không tồn tại trong Hệ Thống.",
    "DDGCTC03": "Đợt đánh giá chi tiết đã được đánh giá không được phép chỉnh sửa.",

    "NSC01": "Mã nhân sự vượt quá 20 ký tự",
    "NSC02": "Họ đệm vượt quá 200 ký tự",
    "NSC03": "Tên vượt quá 100 ký tự",
    "NSC04": "Tên gọi khác vượt quá 200 ký tự",
    "NSC05": "Email vượt quá 50 ký tự",
    "NSC06": "Số điện thoại vượt quá 50 ký tự",
    "NSC07": "Ghi chú vượt quá 200 ký tự",
    "NSC08": "Nhân sự không tồn tại trong Hệ Thống.",
    "NSC09": "Mã nhân sự đã tồn tại trong Hệ Thống.",
    "NSC10": "Nhân sự đã có thông tin lương không được xóa.",
    "NSC11": "Email nội bộ vượt quá 50 ký tự.",
    "NSC12": "Mã nhân sự không được để trống.",
    "NSC13": "Nhân sự không hợp lệ.",
    "NSC14": "UserName vượt quá 100 ký tự",
    "NSC15": "UserName đã tồn tại trong hệ thống",
    "NSC16": "Email đã tồn tại trong hệ thống",
    "NSC17": "Ngày sinh sau ngày hiện tại",
    "NSC18": "Email không đúng định dạng",
    "NSC19": "Số điện thoại không đúng định dạng",
    "NSC20": "Email nội bộ không đúng định dạng",
    "NSC21": "Email nội bộ đã tồn tại trong hệ thống",
    "NSC22": "Dữ liệu đề xuất không được phép cập nhật !",
    "NSC23": "Dữ liệu đã duyệt không được phép cập nhật !",
    "NSC24": "Dữ liệu không tồn tại trong hệ thống !",
    "NSC25": "Tạo nhân sự không thành công !",

    "CNSDGCT01": "Đợt đánh giá chi tiết không tồn tại",

    "NDCC01": "Không tồn tại đánh giá chi tiết này",
    "NDCC02": "Lỗi xử lý lớp con",
    "NDCC03": "Nhân sự đánh giá 2 đã đánh giá.",
    "NDCC04": "Nhân sự đánh giá 3 đã đánh giá.",
    "NDCC05": "Không tồn tại câu hỏi cho đối tượng này",
    "NDCC06": "Đợt đánh giá chi tiết không tồn tại torng Hệ Thống",
    "NDCC07": "Đợt đánh giá không tồn tại trong Hệ Thống",
    "NDCC08": "Id file đính kém không tồn tại trong Hệ Thống",
    "NDCC09": "Đã hết hạn đánh giá đợt này.",
    "NDCC10": "Nhân sự đánh giá 1 đã đánh giá.",
    "NDCC11": "Nhân sự đánh giá 1 chưa đánh giá.",
    "NDCC12": "Nhân sự đánh giá 2 chưa đánh giá.",
    "NDCC13": "Nhân sự đánh giá 3 chưa đánh giá.",
    "NDCC14": "Nhân sự đánh giá 9 đã đánh giá.",
    "NDCC15": "Nhân sự không thể chuyển phiếu đánh giá.",
    "NDCC16": "Nhân sự chưa hoàn thành đánh giá, không thể ký xác nhận và trình phiếu đánh giá.",
    "NDCC17": "Màn hình không hợp lệ.",

    "NSLC01": "Nhân sự lương không tồn tại",
    "NSLC02": "Lý do duyệt vượt quá 200 ký tự",
    "NSLC03": "Mã CDNN vượt quá 50 ký tự",
    "NSLC04": "Nhân sự lương không tồn tại trong hệ thống",
    "NSLC05": "Số quyết định vượt quá 50 ký tự",
    "NSLC06": "Ghi chú vượt quá 200 ký tự",
    "NSLC07": "Nhật ký lương không tồn tại trong hệ thống !",

    "QTDDC01": "Chuỗi vượt quá 1000 ký tự",
    "QTDDC02": "Chuỗi vượt quá 200 ký tự",
    "QTDDC03": "Chuỗi vượt quá 300 ký tự",
    "QTDDC04": "Chuỗi vượt quá 400 ký tự",
    "QTDDC05": "Chuỗi vượt quá 500 ký tự",
    "QTDDC06": "Chuỗi vượt quá 600 ký tự",
    "QTDDC07": "Chuỗi vượt quá 700 ký tự",
    "QTDDC08": "Chuỗi vượt quá 800 ký tự",
    "QTDDC09": "Chuỗi vượt quá 900 ký tự",
    "QTDDC10": "Chuỗi vượt quá 1000 ký tự",
    "QTDDC11": "Không tồn tại bản ghi",
    "QTDDC12": "Ghi chú vượt quá 200 ký tự.",
    "QTDDC20": "Chuỗi vượt quá 2000 ký tự ",
    "QTDDC40": "Chuỗi vượt quá 4000 ký tự",

    "NSCTC01": "Nhân sự chi tiết không tồn tại trong hệ thống.",
    "NSCTC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSCTC03": "Số CMND vượt quá 50 ký tự.",
    "NSCTC04": "Số nhà hộ khẩu thường trú vượt quá 200 ký tự.",
    "NSCTC05": "Số nhà địa chỉ liên lạc vượt quá 200 ký tự.",
    "NSCTC06": "Ghi chú vượt quá 200 ký tự.",
    "NSCTC07": "Nơi cấp CMND vượt quá 200 ký tự.",
    "NSCTC08": "Hộ chiếu vượt quá 50 ký tự.",
    "NSCTC09": "Nơi cấp hộ chiếu vượt quá 200 ký tự.",
    "NSCTC10": "Số nhà nơi sinh vượt quá 200 ký tự.",
    "NSCTC11": "Số nhà quê quán vượt quá 200 ký tự.",
    "NSCTC12": "Điện thoại nhà riêng vượt quá 200 ký tự.",
    "NSCTC13": "Điện thoại cơ quan vượt quá 200 ký tự.",
    "NSCTC14": "Số BHXH vượt quá 100 ký tự.",
    "NSCTC15": "Nhân sự chi tiết đã tồn tại trong hệ thống.",
    "NSCTC16": "Số CMND không đúng định dạng",
    "NSCTC17": "Ngày cấp CMND không hợp lệ",
    "NSCTC18": "Ngày cấp hộ chiếu không hợp lệ",
    "NSCTC19": "Điện thoại nhà riêng không hợp lệ",
    "NSCTC20": "Điện thoại cơ quan không hợp lệ",
    "NSCTC21": "Dữ liệu không thể cập nhật !",

    "NSTDNNC01": "NhanSuTrinhDoNgoaiNguId không tồn tại trong hệ thống",
    "NSTDNNC02": "Dữ liệu không thể cập nhật !",
    "NSTDNNC03": "Lý do duyệt vượt quá 200 ký tự",

    "NSTDCMC01": "Trình độ chuyên môn không tồn tại trong hệ thống",
    "NSTDCMC02": "Dữ liệu không thể cập nhật !",
    "NSTDCMC03": "Lý do duyệt vượt quá 200 ký tự",
    "NSTDCMC04": "Mã xếp loại vượt quá 50 ký tự",
    "NSTDCMC05": "Nơi đào tạo vượt quá 200 ký tự",
    "NSTDCMC06": "Ghi chú vượt quá 200 ký tự",
    "NSTDCMC07": "Tên chuyên ngành vượt quá 200 ký tự",
    "NSTDCMC08": "Số quyết định vượt quá 50 ký tự",
    "NSTDCMC09": "Xếp loại văn bằng vượt quá 200 ký tự",
    "NSTDCMC10": "Nhân sự đã có trình độ chuyên môn này",

    "LLKHVSC01": "Tác giả không được phép không được để trống.",
    "LLKHVSC02": "Tác giả vượt quá 500 ký tự.",
    "LLKHVSC03": "Sách không được phép không được để trống.",
    "LLKHVSC04": "Sách vượt quá 200 ký tự.",
    "LLKHVSC05": "Giáo trình không được phép không được để trống.",
    "LLKHVSC06": "Giáo trình vượt quá 200 ký tự.",
    "LLKHVSC07": "Nhà xuất bản vượt quá 200 ký tự.",
    "LLKHVSC08": "Năm xuất bản không được phép không được để trống.",
    "LLKHVSC09": "Ghi chú vượt quá 200 ký tự.",
    "LLKHVSC10": "Lý lịch khoa học viết sách không tồn tại trong hệ thống.",
    "LLKHVSC11": "Năm xuất bản không hợp lệ.",

    "LLKHCTKHC01": "Công trình không được phép không được để trống.",
    "LLKHCTKHC02": "Công trình vượt quá 500 ký tự.",
    "LLKHCTKHC03": "Tác giả không được phép không được để trống.",
    "LLKHCTKHC04": "Tác giả vượt quá 500 ký tự.",
    "LLKHCTKHC05": "Năm xuất bản không được phép không được để trống.",
    "LLKHCTKHC06": "Trang số vượt quá 200 ký tự.",
    "LLKHCTKHC07": "Volume vượt quá 200 ký tự.",
    "LLKHCTKHC08": "Ghi chú vượt quá 4000 ký tự.",
    "LLKHCTKHC09": "Lý lịch khoa học công trình khoa học không tồn tại trong hệ thống.",
    "LLKHCTKHC10": "Năm xuất bản không hợp lệ.",

    "NSQHGDC01": "Nhân sự quan hệ gia đình không tồn tại trong hệ thống",
    "NSQHGDC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSQHGDC03": "Họ tên vượt quá 100 ký tự.",
    "NSQHGDC04": "Năm sinh vượt quá 10 ký tự.",
    "NSQHGDC05": "Nghề nghiệp vượt quá 200 ký tự.",
    "NSQHGDC06": "Nơi công tác vượt quá 200 ký tự.",
    "NSQHGDC07": "Địa chỉ vượt quá 200 ký tự.",
    "NSQHGDC08": "Số điện thoại vượt quá 50 ký tự.",
    "NSQHGDC09": "Ghi chú vượt quá 200 ký tự.",
    "NSQHGDC10": "Nhân sự không tồn tại trong hệ thống",
    "NSQHGDC11": "Dữ liệu không thể cập nhật !",

    "NSLSCNC01": "Nhân sự lịch sử cá nhân không tồn tại trong hệ thống",
    "NSLSCNC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSLSCNC03": "Tiền án tiền sự vượt quá 500 ký tự.",
    "NSLSCNC04": "Tham gia tổ chức chính trị vượt quá 500 ký tự.",
    "NSLSCNC05": "Tham gia tổ chức nước ngoài vượt quá 500 ký tự.",
    "NSLSCNC06": "Tham gia quản lý KHCN vượt quá 500 ký tự.",
    "NSLSCNC07": "Ghi chú vượt quá 500 ký tự.",
    "NSLSCNC08": "Nhân sự không tồn tại trong hệ thống",
    "NSLSCNC09": "Thân nhân nước ngoài vượt quá 500 ký tự.",
    "NSLSCNC10": "Làm việc chế độ cũ vượt quá 500 ký tự.",
    "NSLSCNC11": "Nhận xét vượt quá 1000 ký tự.",
    "NSLSCNC12": "Dữ liệu không thể cập nhật !",

    "LLKHBSHTTC01": "Tên văn bằng không được phép không được để trống.",
    "LLKHBSHTTC02": "Tên văn bằng vượt quá 200 ký tự.",
    "LLKHBSHTTC03": "Nội dung văn bảng vượt quá 4000 ký tự.",
    "LLKHBSHTTC04": "Số ký mã hiệu không được phép không được để trống.",
    "LLKHBSHTTC05": "Số ký mã hiệu vượt quá 200 ký tự.",
    "LLKHBSHTTC06": "Nơi cấp vượt quá 200 ký tự.",
    "LLKHBSHTTC07": "Ghi chú vượt quá 200 ký tự.",
    "LLKHBSHTTC08": "Lý lịch khoa học bằng sở hữu trí tuệ không tồn tại trong hệ thống.",
    "LLKHBSHTTC09": "Năm xuất bản không hợp lệ.",

    "NSTD01": "Nhân sự tuyển dụng không tồn tại trong hệ thống.",
    "NSTD02": "Nhân sự tuyển dụng đã tồn tại trong hệ thống.",
    "NSTD04": "Sở trường công tác không được vượt quá 500 kí tự.",
    "NSTD05": "Cơ quan tuyển dụng không được vượt quá 500 kí tự.",
    "NSTD06": "Công việc được giao không được vượt quá 500 kí tự.",
    "NSTD07": "Ghi chú không được vượt quá 500 kí tự.",
    "NSTD08": "Nghề nghiệp tuyển dụng không được vượt quá 200 kí tự.",
    "NSTD09": "Công việc đã làm lâu nhất không được vượt quá 500 kí tự.",
    "NSTD10": "Lý do duyệt vượt quá 200 ký tự.",

    "NSTDTH01": "Nhân sự trình độ tin học đã tồn tại trong hệ thống.",
    "NSTDTH02": "Nhân sự trình độ tin học không tồn tại trong hệ thống.",
    "NSTDTH03": "Dữ liệu không thể cập nhật !",
    "NSTDTH04": "Lý do duyệt vượt quá 200 ký tự.",

    "NSCDKHC01": "Nhân sự chức danh khoa học không tồn tại trong hệ thống.",
    "NSCDKHC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSCDKHC03": "Nơi công nhận vượt quá 500 ký tự.",
    "NSCDKHC04": "Ghi chú vượt quá 200 ký tự.",
    "NSCDKHC05": "Dữ liệu không thể cập nhật !",

    "LLKHSPC01": "Sản phẩm không được phép không được để trống.",
    "LLKHSPC02": "Sản phẩm vượt quá 200 ký tự.",
    "LLKHSPC03": "Thời gian không được phép không được để trống.",
    "LLKHSPC04": "Hình thức vượt quá 200 ký tự.",
    "LLKHSPC05": "Quy mô vượt quá 200 ký tự.",
    "LLKHSPC06": "Địa chỉ áp dụng vượt quá 500 ký tự.",
    "LLKHSPC07": "Công dụng vượt quá 4000 ký tự.",
    "LLKHSPC08": "Ghi chú vượt quá 4000 ký tự.",
    "LLKHSPC09": "Lý lịch khoa học sản phẩm không tồn tại trong hệ thống.",

    "LLKHDTKHCNC01": "Tên nhiệm vụ mã số không được phép không được để trống.",
    "LLKHDTKHCNC02": "Tên nhiệm vụ mã số  vượt quá 1000 ký tự.",
    "LLKHDTKHCNC03": "Cơ quan quản lý nhiệm vụ vượt quá 200 ký tự.",
    "LLKHDTKHCNC04": "Ghi chú vượt quá 200 ký tự.",
    "LLKHDTKHCNC05": "Lý lịch khoa học đề tài KHCN không tồn tại trong hệ thống.",
    "LLKHDTKHCNC06": "Mã đề tài vượt quá 50 ký tự.",
    "LLKHDTKHCNC07": "Mã vai trò vượt quá 50 ký tự.",
    "LLKHDTKHCNC08": "Mã đánh giá xếp loại vượt quá 50 ký tự.",
    "LLKHDTKHCNC09": "Sản phẩm vượt quá 1000 ký tự.",

    "LLKHGTC01": "Hình thức và nội dung không được phép không được để trống.",
    "LLKHGTC02": "Hình thức và nội dung vượt quá 200 ký tự.",
    "LLKHGTC03": "Sản phẩm vượt quá 200 ký tự.",
    "LLKHGTC04": "Nội dung giải thưởng không được để trống.",
    "LLKHGTC05": "Nội dung giải thưởng vượt quá 200 ký tự.",
    "LLKHGTC06": "Tổ chức vượt quá 200 ký tự.",
    "LLKHGTC07": "Ghi chú vượt quá 200 ký tự.",
    "LLKHGTC08": "Lý lịch khoa học giải thưởng không tồn tại trong hệ thống.",
    "LLKHGTC09": "Năm tặng thưởng không hợp lệ.",

    "LLKHQTTGDTC01": "Họ tên không được phép không được để trống.",
    "LLKHQTTGDTC02": "Họ tên vượt quá 200 ký tự.",
    "LLKHQTTGDTC03": "Tên luận án không được để trống.",
    "LLKHQTTGDTC04": "Tên luận án vượt quá 500 ký tự.",
    "LLKHQTTGDTC05": "Cơ quan công tác vượt quá 200 ký tự.",
    "LLKHQTTGDTC06": "Ghi chú vượt quá 200 ký tự.",
    "LLKHQTTGDTC07": "Lý lịch khoa học quá trình tham gia đào tạo không tồn tại trong hệ thống.",

    "NSQTCTC01": "Nhân sự quá trình công tác không tồn tại trong hệ thống",
    "NSQTCTC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSQTCTC03": "Ngày bắt đầu vượt quá 20 ký tự.",
    "NSQTCTC04": "Ngày kết thúc vượt quá 20 ký tự.",
    "NSQTCTC05": "",
    "NSQTCTC06": "",
    "NSQTCTC07": "Công việc đảm nhận vượt quá 500 ký tự.",
    "NSQTCTC08": "Đơn vị công tác vượt quá 200 ký tự.",
    "NSQTCTC09": "Ghi chú vượt quá 200 ký tự.",
    "NSQTCTC10": "Nhân sự không tồn tại trong hệ thống",
    "NSQTCTC11": "Số quyết định vượt quá 20 ký tự.",
    "NSQTCTC12": "Dữ liệu không thể cập nhật !",
    "NSQTCTC13": "Chức vụ vượt quá 500 ký tự.",
    "NSQTCTC14": "Chức danh vượt quá 500 ký tự.",

    "NSSKC01": "Nhân sự sức khỏe không tồn tại trong hệ thống",
    "NSSKC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSSKC03": "Ghi chú vượt quá 200 ký tự.",
    "NSSKC04": "Nhân sự không tồn tại trong hệ thống",

    "NSKTC01": "Nhân sự khen thưởng không tồn tại trong hệ thống",
    "NSKTC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSKTC03": "Số quyết định vượt quá 50 ký tự.",
    "NSKTC04": "Hình thức khen thưởng khác vượt quá 200 ký tự.",
    "NSKTC05": "Nội dung vượt quá 200 ký tự.",
    "NSKTC06": "Ghi chú vượt quá 200 ký tự.",
    "NSKTC07": "Nhân sự không tồn tại trong hệ thống",
    "NSKTC08": "Đơn vị khen thưởng vượt quá 200 ký tự.",
    "NSKTC09": "Dữ liệu không thể cập nhật !",

    "NSKLC01": "Nhân sự kỷ luật không tồn tại trong hệ thống",
    "NSKLC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSKLC03": "Số quyết định vượt quá 50 ký tự.",
    "NSKLC04": "Hình thức kỷ luật khác vượt quá 200 ký tự.",
    "NSKLC05": "Nội dung vượt quá 200 ký tự.",
    "NSKLC06": "Ghi chú vượt quá 200 ký tự.",
    "NSKLC07": "Nhân sự không tồn tại trong hệ thống",
    "NSKLC08": "Đơn vị kỷ luật vượt quá 200 ký tự.",
    "NSKLC09": "Dữ liệu không thể cập nhật !",

    "NSQTDC01": "Nhân sự quá trình đoàn không tồn tại trong hệ thống",
    "NSQTDC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSQTDC03": "Nơi sinh hoạt vượt quá 500 ký tự.",
    "NSQTDC04": "Ghi chú vượt quá 200 ký tự.",
    "NSQTDC05": "Nhân sự không tồn tại trong hệ thống",
    "NSQTDC06": "Dữ liệu không thể cập nhật !",

    "NSQTDANGC01": "Nhân sự quá trình đảng không tồn tại trong hệ thống",
    "NSQTDANGC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSQTDANGC03": "Nơi sinh hoạt vượt quá 500 ký tự.",
    "NSQTDANGC04": "Ghi chú vượt quá 200 ký tự.",
    "NSQTDANGC05": "Nhân sự không tồn tại trong hệ thống",
    "NSQTDANGC06": "Dữ liệu không thể cập nhật !",
    
    "NSDDC01": "Nhân sự đoàn đảng không tồn tại trong hệ thống",
    "NSDDC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSDDC03": "Nơi kết nạp đoản vượt quá 500 ký tự.",
    "NSDDC04": "Nơi kết nạp đảng khác vượt quá 500 ký tự.",
    "NSDDC05": "Nơi sinh hoạt đảng hiện tại vượt quá 200 ký tự.",
    "NSDDC06": "Sổ thương tật vượt quá 200 ký tự.",
    "NSDDC07": "Hình thức thương tật vượt quá 200 ký tự.",
    "NSDDC08": "Nội dung vượt quá 200 ký tự.",
    "NSDDC09": "Ghi chú vượt quá 200 ký tự.",
    "NSDDC10": "Nhân sự đoàn đảng đã tồn tại trong hệ thống.",

    "NSDTBDC01": "Nhân sự đào tạo bồi dưỡng không tồn tại trong hệ thống",
    "NSDTBDC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSDTBDC03": "Đơn vị vượt quá 200 ký tự.",
    "NSDTBDC04": "Chuyên ngành vượt quá 200 ký tự.",
    "NSDTBDC05": "Văn bằng vượt quá 200 ký tự.",
    "NSDTBDC06": "Chứng chỉ vượt quá 500 ký tự.",
    "NSDTBDC07": "Trường đào tạo vượt quá 500 ký tự.",
    "NSDTBDC08": "Số quyết định vượt quá 50 ký tự.",
    "NSDTBDC09": "Ghi chú vượt quá 200 ký tự.",
    "NSDTBDC10": "Dữ liệu không thể cập nhật !",
    "NSDTBDC11": "Xếp loại văn bằng vượt quá 200 ký tự.",

    "NSQTCDC01": "Nhân sự quá trình công đoàn không tồn tại trong hệ thống",
    "NSQTCDC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSQTCDC03": "Nơi sinh hoạt vượt quá 500 ký tự.",
    "NSQTCDC04": "Ghi chú vượt quá 200 ký tự.",
    "NSQTCDC05": "Dữ liệu không thể cập nhật !",

    "NSTDC01": "Nhân sự trình độ không tồn tại trong hệ thống",
    "NSTDC02": "Lý do duyệt vượt quá 200 ký tự.",
    "NSTDC03": "Trình độ ngoại ngữ vượt quá 500 ký tự.",
    "NSTDC04": "Trình độ vi tính vượt quá 500 ký tự.",
    "NSTDC05": "Ghi chú vượt quá 200 ký tự.",
    "NSTDC06": "Trình độ nghiệp vụ theo chuyên ngành vượt quá 500 ký tự.",

    "NSKNC01": "Lý do duyệt vượt quá 200 ký tự.",
    "NSKNC02": "Cơ quan kiêm nhiệm không được phép không được để trống.",
    "NSKNC03": "Chức vụ kiêm nhiệm không được phép không được để trống.",
    "NSKNC04": "Số quyết định vượt quá 50 ký tự.",
    "NSKNC05": "Ghi chú vượt quá 200 ký tự.",
    "NSKNC06": "Nhân sự kiêm nhiệm không tồn tại trong hệ thống.",
    "NSKNC07": "Dữ liệu không thể cập nhật !",

    "DBC01": "Định biên không tồn tại trong hệ thống",
    "DBC02": "Định biên đã tồn tại trong hệ thống",
    "DBC03": "Ghi chú phê duyệt vượt quá 200 ký tự.",
    "DBC04": "Ghi chú vượt quá 200 ký tự.",
    "DBC05": "Định biên đã được sử dụng không được phép chỉnh sửa.",
    "DBC06": "Số lượng nhân sự đã nhập vượt quá số lượng đề xuất.",
    "DBC07": "Số lượng nhân sự cấp lương vượt quá số lượng đề xuất.",
    "DBC08": "Số lượng nhân sự tự trả vượt quá số lượng đề xuất.",

    "SBMC01": "Biểu mẫu không tồn tại trong hệ thống.",
    "SBMC02": "Mã biểu mẫu vượt quá 50 ký tự.",
    "SBMC03": "Mã biểu mẫu không được để trống.",
    "SBMC04": "Tên biểu mẫu vượt quá 200 ký tự.",
    "SBMC05": "Tên file vượt quá 200 ký tự.",
    "SBMC06": "Loại file vượt quá 200 ký tự.",
    "SBMC07": "Ghi chú vượt quá 4000 ký tự.",
    "SBMC08": "Checksum vượt quá 50 ký tự.",
    "SBMC09": "Tên biểu mẫu không được để trống.",

    "KHTDCTC01": "Nội dung công việc không được phép không được để trống.",
    "KHTDCTC02": "Nội dung công việc vượt quá 500 ký tự.",
    "KHTDCTC03": "Ngày bắt đầu không được phép không được để trống.",
    "KHTDCTC04": "Ngày kết thúc không được phép không được để trống.",
    "KHTDCTC05": "Ghi chú vượt quá 500 ký tự.",
    "KHTDCTC06": "Ngày kết thúc nhỏ hơn ngày bắt đầu.",
    "KHTDCTC07": "Kế hoạch tuyển dụng chi tiết không tồn tại trong hệ thống.",

    "KHTDC01": "Mã kế hoạch không được vượt quá 20 ký tự.",
    "KHTDC02": "Tên kế hoạch không được vượt quá 500 ký tự.",
    "KHTDC03": "Tóm tắt môn thi không được vượt quá 1000 ký tự.",
    "KHTDC04": "Nguồn tuyển dụng không được vượt quá 1000 ký tự.",
    "KHTDC05": "Hội đồng tham gia không được vượt quá 1000 ký tự.",
    "KHTDC06": "Ghi chú không được vượt quá 500 ký tự.",
    "KHTDC07": "Dữ liệu kế hoạch đã tồn tại.",
    "KHTDC08": "Kế hoạch tuyển dụng không tồn tại trong hệ thống.",
    "KHTDC09": "Danh mục tiêu chuẩn tuyển dụng không tồn tại trong hệ thống.",
    "KHTDC10": "Ngày kết thúc nhỏ hơn ngày bắt đầu.",
    "KHTDC11": "Năm không được phép không được để trống.",
    "KHTDC12": "Mã kế hoạch không được phép không được để trống.",
    "KHTDC13": "Tên kế hoạch không được phép không được để trống.",
    "KHTDC14": "Ngày bắt đầu không được phép không được để trống.",
    "KHTDC15": "Ngày kết thúc không được phép không được để trống.",
    "KHTDC16": "Không thể đề xuất kế hoạch đã được duyệt.",
    "KHTDC17": "Trạng thái kế hoạch tuyển dụng không hợp lệ.",
    "KHTDC18": "Không thể thu hồi kế hoạch tuyển dụng.",
    "KHTDC19": "Không thể chỉnh sửa hay xóa kế hoạch đã đề xuất.",
    "KHTDC20": "Tài khoản không có cơ quan nên không được cập nhật kế hoạch.",
    "KHTDC21": "Hình thức trả lương không hợp lệ",
    "KHTDC22": "Nhân sự đã có quyết định tuyển dụng",
    "KHTDC23": "Nội dung không được vượt quá 1000 kí tự",
    "KHTDC24": "Không thể duyệt kế hoạch chưa được đề xuất",
    "KHTDC25": "Không thể duyệt kế hoạch đã được ĐHQG xét duyệt",
    "KHTDC26": "Không thể đề xuất kế hoạch chưa duyệt",
    "KHTDC27": "Không thể duyệt kế hoạch chưa được trưởng đơn vị duyệt",
    "KHTDC28": "Nội dung xác nhận không được vượt quá 1000 kí tự",
    "KHTDC29": "Kế hoạch tuyển dụng đã được xác nhận, bạn không thể xác nhận lần nữa.",
    "KHTDC30": "Kế hoạch tuyển dụng đã được xác nhận, bạn không thể chỉnh sửa kết quả ứng viên.",

    "DBCTC01": "Ghi chú vượt quá 200 ký tự.",

    "KHTDTCC01": "Yêu cầu vượt quá 2000 ký tự.",
    "KHTDTCC02": "Ghi chú vượt quá 2000 ký tự.",

    "KHTDDXC01": "Kế hoạch tuyển dụng đề xuất đơn vị lý do duyệt vượt quá 500 ký tự.",
    "KHTDDXC02": "Kế hoạch tuyển dụng đề xuất lý do duyệt vượt quá 500 ký tự.",
    "KHTDDXC03": "Ghi chú vượt quá 500 ký tự.",
    "KHTDDXC04": "Kế hoạch tuyển dụng không tồn tại.",
    "KHTDDXC05": "Kế hoạch tuyển dụng đề xuất không tồn tại.",

    "QDC01": "Số quyết định không được vượt quá 50 ký tự.",
    "QDC02": "Số quyết định không được phép không được để trống.",
    "QDC03": "Ngày hiệu lực không được phép không được để trống.",
    "QDC04": "Nội dung không được vượt quá 500 ký tự.",
    "QDC05": "Nội dung căn cứ không được vượt quá 500 ký tự.",
    "QDC06": "Chức vụ người ký không được vượt quá 100 ký tự.",
    "QDC07": "Chức vụ người ký thay không được vượt quá 100 ký tự.",
    "QDC08": "Ghi chú không được vượt quá 500 ký tự.",
    "QDC09": "Quyết định không tồn tại trong hệ thống.",
    "QDC10": "Số quyết định đã tồn tại trong hệ thống.",
    "QDC11": "Trích yếu không được vượt quá 1000 ký tự.",
    "QDC12": "Nơi nhận không được vượt quá 1000 ký tự.",

    "TDCTC01": "Ghi chú không được vượt quá 500 ký tự.",
    "TDCTC02": "Tuyển dụng chi tiết không tồn tại trong hệ thống.",
    "TDCTC03": "Không tồn tại nhân sự trong quyết định tuyển dụng.",

    "PCHDTSC01": "Người hướng dẫn tập sự không tồn tại trong hệ thống",
    "PCHDTSC02": "Người quyết định không tồn tại trong hệ thống",
    "PCHDTSC03": "Người tập sự không tồn tại trong hệ thống",
    "PCHDTSC04": "Ngày kết thúc tập sự nhỏ hơn ngày bắt đầu tập sự",
    "PCHDTSC05": "Ngày kết thúc nộp báo cáo nhỏ hơn ngày bắt đầu nộp báo cáo",
    "PCHDTSC06": "Nội dung báo cáo vượt quá 4000 ký tự",
    "PCHDTSC07": "Ghi chú vượt quá 4000 ký tự",
    "PCHDTSC08": "Nội dung đánh giá vượt quá 4000 ký tự",
    "PCHDTSC09": "Quyết định phân công hướng dẫn tập sự không tồn tại trong hệ thống",
    "PCHDTSC10": "Đã nộp báo cáo tập sự",
    "PCHDTSC11": "Không thể nộp báo cáo trước hoặc sau thời gian cho phép",
    "PCHDTSC12": "Trạng thái đánh giá tập sự không hợp lệ",
    "PCHDTSC13": "Nhân sự không thuộc quyết định tập sự",
    "PCHDTSC14": "Báo cáo tập sự không tồn tại",

    "DTTDLC01": "Dữ liệu nhân sự chi tiết không ở trạng thái đề xuất",
    "DTTDLC02": "Dữ liệu nhân sự tuyển dụng không ở trạng thái đề xuất",
    "DTTDLC03": "Dữ liệu nhân sự đoàn đảng không ở trạng thái đề xuất",
    "DTTDLC04": "Dữ liệu nhân sự lương không ở trạng thái đề xuất",
    "DTTDLC05": "Dữ liệu nhân sự sức khỏe không ở trạng thái đề xuất",
    "DTTDLC06": "Dữ liệu nhân sự trình đô không ở trạng thái đề xuất",
    "DTTDLC07": "Dữ liệu nhân sự đào tạo bồi dưỡng không ở trạng thái đề xuất",
    "DTTDLC08": "Dữ liệu nhân sự trình độ chuyên môn không ở trạng thái đề xuất",
    "DTTDLC09": "Dữ liệu nhân sự trình độ ngoại ngữ không ở trạng thái đề xuất",
    "DTTDLC10": "Dữ liệu nhân sự trình độ tin học không ở trạng thái đề xuất",
    "DTTDLC11": "Dữ liệu nhân sự chức danh khoa học không ở trạng thái đề xuất",
    "DTTDLC12": "Dữ liệu nhân sự quá trình đảng không ở trạng thái đề xuất",
    "DTTDLC13": "Dữ liệu nhân sự quá trình đoàn không ở trạng thái đề xuất",
    "DTTDLC14": "Dữ liệu nhân sự quá trình công đoàn không ở trạng thái đề xuất",
    "DTTDLC15": "Dữ liệu nhân sự quá trình công tác không ở trạng thái đề xuất",
    "DTTDLC16": "Dữ liệu nhân sự khen thưởng không ở trạng thái đề xuất",
    "DTTDLC17": "Dữ liệu nhân sự kỷ luật không ở trạng thái đề xuất",
    "DTTDLC18": "Dữ liệu nhân sự kiêm nhiệm không ở trạng thái đề xuất",
    "DTTDLC19": "Dữ liệu nhân sự quan hệ gia đình không ở trạng thái đề xuất",
    "DTTDLC20": "Trạng thái dữ liệu không hợp lệ",
    "DTTDLC21": "Dữ liệu nhân sự thi đua khen thưởng không ở trạng thái đề xuất",
    "DTTDLC22": "Dữ liệu nhân sự lịch sử cá nhân không ở trạng thái đề xuất",
    "DTTDLC23": "Dữ liệu nhân sự hoàn cảnh kinh tế không ở trạng thái đề xuất",

    "HDC01": "Hợp đồng không tồn tại trong hệ thống.",
    "HDC02": "Loại hợp đồng không được phép không được để trống.",
    "HDC03": "Số hợp đồng không được vượt quá 50 ký tự.",
    "HDC04": "Hợp đồng từ ngày không được phép không được để trống.",
    "HDC05": "Hợp đồng đến ngày không được phép không được để trống.",
    "HDC06": "Ghi chú không được vượt quá 200 ký tự.",
    "HDC07": "Chức vụ người ký không được vượt quá 200 ký tự.",
    "HDC08": "Chức vụ người ký thay được vượt quá 200 ký tự.",
    "HDC09": "Hợp đồng từ ngày nhỏ hơn hợp đồng đến ngày",
    "HDC10": "Không thể xác nhận hợp đồng không ở trạng thái đề xuất",
    "HDC11": "Hợp đồng đã xác nhận không được phép chỉnh sửa.",

    "HDCTC01": "Hợp đồng chi tiết không tồn tại trong hệ thống.",
    "HDCTC02": "Lý do xác nhận hợp đồng không được vượt quá 500 ký tự.",
    "HDCTC03": "Nhiệm vụ không được vượt quá 500 ký tự.",
    "HDCTC04": "Thời gian làm việc không được vượt quá 500 ký tự.",
    "HDCTC05": "Phương tiện làm việc không được vượt quá 500 ký tự.",
    "HDCTC06": "Phương tiện đi lại không được vượt quá 500 ký tự.",
    "HDCTC07": "Thiết vị bảo hộ không được vượt quá 500 ký tự.",
    "HDCTC08": "Số ngày nghĩ hưởng lương không được vượt quá 500 ký tự.",
    "HDCTC09": "Chế độ bảo hiểm không được vượt quá 500 ký tự.",
    "HDCTC10": "Phúc lợi không được vượt quá 500 ký tự.",
    "HDCTC11": "Thỏa thuận khác không được vượt quá 500 ký tự.",
    "HDCTC12": "Khoản thưởng khác tiết không được vượt quá 500 ký tự.",
    "HDCTC13": "Ghi chú chi tiết không được vượt quá 500 ký tự.",
    "HDCTC14": "Không thể duyệt hợp đồng chưa được nhân sự xác nhận",
    "HDCTC15": "Không thể đề xuất hợp đồng đã xử lý",
    "HDCTC16": "Không thể duyệt hợp đồng chưa đề xuất",
    "HDCTC17": "Trạng thái xác nhận hợp đồng không hợp lệ",
    "HDCTC18": "Trạng thái duyệt hợp đồng không hợp lệ",
    "HDCTC19": "Mức lương chính không được vượt quá 500 ký tự.",
    "HDCTC20": "Hình thức trả lương không được vượt quá 500 ký tự.",
    "HDCTC21": "Ngày nhận lương không được vượt quá 500 ký tự.",
    "HDCTC22": "Chế độ nâng lương không được vượt quá 500 ký tự.",
    "HDCTC23": "Chế độ đào tạo không được vượt quá 1000 ký tự.",
    "HDCTC24": "Nghĩa vụ không được vượt quá 1000 ký tự.",
    "HDCTC25": "Hợp đồng làm lại không được vượt quá 1000 ký tự.",
    "HDCTC26": "Ghi chú người gửi không được vượt quá 1000 ký tự.",
    "HDCTC27": "Lý do duyệt không được vượt quá 1000 ký tự.",
    "HDCTC28": "Địa điểm làm việc không được vượt quá 1000 ký tự.",
    "HDCTC29": "Khoản trả khác không được vượt quá 1000 ký tự.",
    "HDCTC30": "Phụ cấp khác không được vượt quá 1000 ký tự.",
    "HDCTC31": "Thời hạn nâng lương không được vượt quá 1000 ký tự.",
    "HDCTC32": "Nghề nghiệp trước khi tuyển dụng không được vượt quá 500 ký tự.",
    
    "HDCTPCC01": "Hợp đồng chi tiết phụ cấp không tồn tại trong hệ thống.",
    "HDCTPCC02": "Ghi chú không được vượt quá 500 ký tự.",
    "TDKTC01": "Lý do duyệt không được vượt quá 200 ký tự.",
    "TDKTC02": "Số quyết định không được vượt quá 200 ký tự.",
    "TDKTC03": "Tên danh hiệu không được vượt quá 200 ký tự.",
    "TDKTC04": "Nội dung không được vượt quá 200 ký tự.",
    "TDKTC05": "Ghi chú không được vượt quá 200 ký tự.",
    "TDKTC06": "Dữ liệu không tồn tại trong hệ thống.",
    "TDKTC07": "Dữ liệu không thể cập nhật !",

    "EPTNEXIST": "Mã đã được sử dụng",
    "EPTNEMPTY": "Không tìm thấy trong hệ thống",
  
    "PTN0195": "Mã phòng thí nghiệm là bắt buộc",
    "PTN0196": "Tên phòng thí nghiệm là bắt buộc",
    "PTN0199": "Mã phòng thí nghiệm vượt quá 20 ký tự",
    "PTN0200": "Tên phòng thí nghiệm vượt quá 200 ký tự",
    "PTN0201": "Mô tả vượt quá 4000 ký tự",
    "PTN0202": "Chứng chỉ vượt quá 200 ký tự",
    "PTN0203": "Tư cách pháp nhân vượt quá 200 ký tự",
    "PTN0204": "Số tài khoản vượt quá 200 ký tự",
    "PTN0205": "Chủ tài khoản vượt quá 200 ký tự",
    "PTN0206": "Ngân hàng vượt quá 200 ký tự",
    "PTN0207": "Địa chỉ vượt quá 500 ký tự",
    "PTN0208": "Số điện thoại vượt quá 100 ký tự",
    "PTN0212": "Ghi chú vượt quá 500 ký tự",
    "PTN0272": "Tên phòng thí nghiệm tiếng anh vượt quá 500 ký tự",
    "PTN0273": "Tên viết tắt vượt quá 500 ký tự",
    "PTN0275": "Số quyết định thành lập vượt quá 50 ký tự",
    "PTN0276": "Nội dung quyết định thành lập vượt quá 1000 ký tự",
    "PTN0277": "Mục tiêu vượt quá 4000 ký tự",
    "PTN0278": "Phòng thí nghiệm đã sử dụng, không được xóa",
  
    "PTN0236": "Chọn công cụ là bắt buộc",
    "PTN0237": "Chọn cơ quan là bắt buộc",
    "PTN0238": "Chọn tình trạng thiết bị là bắt buộc",
    "PTN0239": "Mã thiết bị vượt quá 50 ký tự",
    "PTN0240": "Nhập mã thiết bị",
    "PTN0241": "Chọn phòng thí nghiệm là bắt buộc",
    "PTN0244": "Mô tả vượt quá 4000 ký tự",
    "PTN0245": "Nhà cung cấp vượt quá 500 ký tự",
    "PTN0246": "Ghi chú vượt quá 500 ký tự",
    "PTN0307": "Nhập tên thiết bị",
    "PTN0308": "Tên thiết bị vượt quá 500 ký tự",
    "PTN0310": "Thông tin kỹ thuật vượt quá 4000 ký tự",
    "PTN0311": "Điều kiện vận hành vượt quá 1000 ký tự",
    "PTN0312": "Thiết bị đã đăng ký sử dụng, không được xóa",
  
    "PTN0056": "Chọn phòng thí nghiệm là bắt buộc",
    "PTN0057": "Chọn nhân sự là bắt buộc",
    "PTN0058": "Chọn cơ quan nhân sự",
    "PTN0059": "Ngày bắt đầu là bắt buộc",
    "PTN0060": "Ngày kết thúc là bắt buộc",
    "PTN0061": "Mục tiêu không vượt quá 500 kí tự",
    "PTN0062": "Năng lực sử dụng không vượt quá 500 kí tự",
    "PTN0066": "Ghi chú không vượt quá 500 kí tự",
  
    "PTN0073": "Ngày bắt đầu là bắt buộc",
    "PTN0074": "Ngày kết thúc là bắt buộc",
    "PTN0075": "Chọn người sử dụng",
    "PTN0076": "Kết quả sử dụng không vượt quá 500",
    "PTN0077": "Chất thải không vượt quá 500",
    "PTN0078": "Vấn đề an toàn không vượt quá 500",
    "PTN0079": "Kiến nghị không vượt quá 500",
    "PTN0080": "Ghi chú không vượt quá 500",
    "PTN0258": "Mục đích sử dụng không vượt quá 500",
  
    "PTN0319": "Chọn thiết bị là bắt buộc",
    "PTN0320": "Chọn vật tư là bắt buộc",
    "PTN0323": "Chọn loại tiêu hao là bắt buộc",
    "PTN0324": "Ghi chú không vượt quá 500",
  
    "PTN0317": "Chọn thiết bị là bắt buộc",
    "PTN0318": "Ghi chú không vượt quá 500",
  
    "PTN0292": "Nhập tiêu đề",
    "PTN0293": "Tiêu đề không vượt quá 500",
    "PTN0295": "Ghi chú không vượt quá 500",
  
    "PTN0285": "Ngày thực hiện là bắt buộc",
    "PTN0286": "Chọn người thực hiện là bắt buộc",
    "PTN0287": "Chọn tình trạng thiết bị là bắt buộc",
    "PTN0288": "Chọn hình thức là bắt buộc",
    "PTN0290": "Nội dung không vượt quá 1000 kí tự",
    "PTN0291": "Ghi chú không vượt quá 500 kí tự",
  
    "PTN0298": "Ngày đăng ký là bắt buộc",
    "PTN0299": "Chọn người đăng ký là bắt buộc",
    "PTN0300": "Chọn tình trạng thiết bị",
    "PTN0301": "Lý do mang ra không vượt quá 500 kí tự",
    "PTN0305": "Lý do không vượt quá 500 kí tự",
    "PTN0306": "Ghi chú không vượt quá 500 ký tự",
  
    "PTN0131": "Chọn phòng thí nghiệm là bắt buộc",
    "PTN0132": "Chọn nhân sự là bắt buộc",
    "PTN0135": "Khóa học đào tạo không vượt quá 200 kí tự",
    "PTN0136": "Vận hành thiết bị không vượt quá 500 kí tự",
    "PTN0137": "Kinh nghiệm vận hành không vượt quá 500 kí tự",
    "PTN0138": "Chứng chỉ không vượt quá 200 kí tự",
    "PTN0141": "Ghi chú không vượt quá 500 kí tự",

    "PTN0190": "Chọn nhân sự là bắt buộc",
    "PTN0191": "Chọn phòng thí nghiệm là bắt buộc",
    "PTN0194": "Ghi chú không vượt quá 500 kí tự",
    
    "NSHCKTC01": "Nhân sự hoàn cảnh kinh tế không tồn tại trong hệ thống.",
    "NSHCKTC02": "Lý do duyệt vượt quá 200 ký tự",
    "NSHCKTC03": "Nguồn thu nhập chính vượt quá 500 ký tự",
    "NSHCKTC04": "Nguồn khác vượt quá 500 ký tự",
    "NSHCKTC05": "Tên nhà ở tự mua vượt quá 500 ký tự",
    "NSHCKTC06": "Tên nhà ở được cấp vượt quá 500 ký tự",
    "NSHCKTC07": "Đất sản xuất kinh doanh vượt quá 500 ký tự",
    "NSHCKTC08": "Ghi chú vượt quá 500 ký tự",
    "NSHCKTC09": "Dữ liệu không thể cập nhật !",

    "GP01": "Nhóm quyền cha không tồn tai trong hệ thống",
    "GP02": "Tên nhóm quyền đã tồn tại trong hệ thống.",
    "GP03": "Nhóm quyền không tồn tại trong hệ thống.",
    
    "GPU01": "Chọn người dùng và nhóm quyền để đồng bộ quyền",
    "GPU02": "Nhóm quyền không tồn tại trong hệ thống",

    "PCBCTSC01": "Công việc được phân công không được vượt quá 500 ký tự",
    "PCBCTSC02": "Phẩm chất đạo đức không được vượt quá 500 ký tự",
    "PCBCTSC03": "Năng lực không được vượt quá 500 ký tự",
    "PCBCTSC04": "Ý thức tổ chức chấp hành chủ trương không được vượt quá 500 ký tự",
    "PCBCTSC05": "Tham gia các hoạt động đoàn thể không được vượt quá 500 ký tự",
    "PCBCTSC06": "Ghi chú không được vượt quá 500 ký tự",
    "PCBCTSC07": "Đề xuất khác không được vượt quá 2000 ký tự",
    "PCBCTSC08": "Nhận xét không được vượt quá 2000 ký tự",
    "PCBCTSC09": "Báo cáo tập sự không tồn tại trong hệ thống!",
    "PCBCTSC10": "Trạng thái báo cáo không hợp lệ !",
    "PCHDTSC15": "Quyết định phân công hướng dẫn tập sự không tồn tại trong hệ thống!",

    "UVOC01": "Ứng viên không tồn tại trong hệ thống",
    "UVOC02": "Lý do duyệt không được vượt quá 200 ký tự",
    "UVOC03": "Họ đệm không được vượt quá 200 ký tự",
    "UVOC04": "Tên không được vượt quá 50 ký tự",
    "UVOC05": "Số CMND không được vượt quá 20 ký tự",
    "UVOC06": "Nơi cấp CMND không được vượt quá 200 ký tự",
    "UVOC07": "Số điện thoại không được vượt quá 20 ký tự",
    "UVOC08": "Email không được vượt quá 200 ký tự",
    "UVOC09": "Địa chỉ không được vượt quá 500 ký tự",
    "UVOC10": "Vị trí ứng tuyển không được vượt quá 500 ký tự",
    "UVOC11": "Nơi đào tạo cử nhân không được vượt quá 1000 ký tự",
    "UVOC12": "Nơi đào tạo thạc sĩ không được vượt quá 1000 ký tự",
    "UVOC13": "Nơi đào tạo tiến sĩ không được vượt quá 1000 ký tự",
    "UVOC14": "Hướng nghiên cứu không được vượt quá 1000 ký tự",
    "UVOC15": "Vị trí cơ quan không được vượt quá 1000 ký tự",
    "UVOC16": "Chứng chỉ không được vượt quá 500 ký tự",
    "UVOC17": "Ghi chú không được vượt quá 200 ký tự",
    "UVOC18": "Nội dung xác nhận không được vượt quá 2000 ký tự",
    "UVOC19": "Nhận xét không được vượt quá 2000 ký tự",
    "UVOC20": "Không thể xác nhận kết quả tuyển nhân sự khi ứng viên chưa có kết quả!",

    "UVOC21": "Kế hoạch tuyển dụng đã hết hạn đăng ký",
    "UVOC22": "",
    "UVOC23": "Kế hoạch tuyển dụng không được để trống",
    "UVOC24": "Họ đệm không được để trống",
    "UVOC25": "Tên không được để trống",
    "UVOC26": "Số CMND không được để trống",
    "UVOC27": "Nơi cấp CMND không được để trống",
    "UVOC28": "Số điện thoại không được để trống",
    "UVOC29": "Email không được để trống",
    "UVOC30": "Trình độ chuyên môn không được để trống",
    "UVOC31": "Lĩnh vực không được để trống",
    "UVOC32": "Nơi đào tạo cử nhân không được để trống",
    "UVOC33": "Kế hoạch tuyển dụng đã được xác nhận",
    "IUV01": "Bạn chưa chọn file import!",
    "IUV02": "Thông tin ứng viên không hợp lệ!",
    "EB01": "",
    "EB02": "Không tìm thấy dữ liệu cập nhật",
    "YTTDMTCC01": "Tiêu đề không được vượt quá 500 ký tự",
    "YTTDMTCC02": "Ghi chú không được vượt quá 4000 ký tự",
    "YTTDMTCC03": "Mẫu tiêu chí không tồn tại trong hệ thống",
    "YTTDMTCC04": "Mã mẫu tiêu chí không được vượt quá 50 ký tự",
    "YTTDMTCCTC01": "Tên tiêu chí không được vượt quá 1000 ký tự",
    "YTTDMTCCTC02": "Ghi chú không được vượt quá 4000 ký tự",
    "YTTDMTCCTC03": "Mẫu tiêu chí chi tiết không tồn tại trong hệ thống",
    "YTTDMTCCTC04": "Điểm số nhập không hợp lệ.",
    "YTTDMTCCTC05": "Cá nhân chưa nhập điểm số nên quản lý không được phép đánh giá.",
    "QDDGC01": "Đợt đánh giá quý không tồn tại trong hệ thống.",
    "QDDGC02": "Tên đợt đánh giá không được vượt quá 500 ký tự.",
    "QDDGC03": "Ghi chú không được vượt quá 200 ký tự.",
    "QDDGCTC01": "Đợt đánh giá quý chi tiết không tồn tại trong hệ thống",
    "QDDGCTC02": "Ghi chú không được vượt quá 200 ký tự.",
    "QDDGCTC03": "Loại đối tượng đánh giá không tồn tại trong hệ thống",

    "NSDGQ01": "Ý kiến đánh giá 1 không vượt quá 1000 ký tự",
    "NSDGQ02": "Ý kiến đánh giá 2 không vượt quá 1000 ký tự",
    "NSDGQ03": "Ý kiến đánh giá 3 không vượt quá 1000 ký tự",
    "NSDGQ04": "Ý kiến đánh giá 4 không vượt quá 1000 ký tự",
    "NSDGQ05": "Ý kiến đánh giá 5 không vượt quá 1000 ký tự",
    "NSDGQ06": "Ghi chú không vượt quá 500 ký tự",
    "NSDGQ07": "Nhân sự đánh giá không tồn tại",
    "NSDGQ08": "Đợt đánh giá không tồn tại",
    "NSDGQ09": "Nhân sự đã tồn tại trong đợt đánh giá",
    "NSDGQ10": "Nhân sự chưa đánh giá không được phép chuyển",
    "NSDGQ11": "Cấp trên đã đánh giá không được phép chỉnh sửa",
    "NSDGQ12": "Đã hết hạn đánh giá đợt này.",

    "CTMDHT01": "Tên nhiệm vụ không được vượt quá 1000 ký tự",
    "CTMDHT02": "Ghi chú đánh giá không được vượt quá 4000 ký tự",
    "CTMDHT03": "Ghi chú không được vượt quá 4000 ký tự",
    "CTMDHT04": "Mức độ công việc không tồn tại",
    "CTYTTD01": "Ghi chú không được vượt quá 500 ký tự",
    "CTYTTD02": "Ghi chú 1 không được vượt quá 1000 ký tự",
    "CTYTTD03": "Ghi chú 2 không được vượt quá 1000 ký tự",
    "CTYTTD04": "Ghi chú 3 không được vượt quá 1000 ký tự",

    "QNSDGC01": "Nhân sự cấp 2 không hợp lệ",
    "QNSDGC02": "Cá nhân chưa đánh giá nên quản lý không được phép đánh giá",
    "QNSDGC03": "Cá nhân chưa đánh giá tiến độ nên quản lý không được phép đánh giá",
    "QNSDGC04": "Cá nhân chưa đánh giá chất lượng nên quản lý không được phép đánh giá",
    "QNSDGC05": "Quý nhân sự đánh giá không tồn tại trong hệ thống",

    "QNSDGLS01": "Ý kiến cũ không được vượt quá 1000 kí tự",
    "QNSDGLS02": "Ý kiến mới không được vượt quá 1000 kí tự",
    "QNSDGLS03": "Nội dung không được vượt quá 2000 kí tự",

    "DTC02": "Tiêu đề không được vượt quá 500 ký tự",
    "DTC03": "Nội dung không được vượt quá 1000 ký tự",
    "DTC04": "Không thể trình hay xin ý kiến cho đơn từ của nhân sự khác",
    "DTC05": "Không thể trình hay xin ý kiến cho đơn từ đã được phê duyệt",
    "DTC06": "Không thể duyệt đơn từ được gửi hoặc trình cho nhân sự khác",
    "DTC07": "Tiêu đề không được bỏ trống",
    "DTC08": "Nội dung không được bỏ trống",
    "DTC09": "Nhân sự bàn giao không được bỏ trống",
    "DTC10": "Ngày bàn giao không được bỏ trống",
    "DTC11": "Thời gian nghỉ việc không được bỏ trống",
    "DTC12": "Số quyết định không được vượt quá 50 ký tự",
    "DTC13": "Không thể duyệt đơn từ này",
    "DTC14": "Không thể tạo quyết định cho đơn từ chưa được duyệt",
    "DTC15": "Thời gian của đơn từ không hợp lệ",
    "DTC16": "Lý do duyệt không được vượt quá 1000 ký tự",
    "DTC17": "Không thể xóa đơn đã được duyệt hoặc tạo quyết định",
    "DTC18": "Trạng thái duyệt không hợp lệ",
    "DTC19": "Đã có thông tin đề xuất mới không được phép duyệt.",
    "DTC20": "Đề án đã được đề xuất.",
    "DTC21": "Không được phép cập nhật dữ liệu.",

    "DTNNC01": "Đơn từ người nhận không tồn tại hệ thông.",
    "DTNNC02": "Nội dung xin ý kiến không được vượt quá 1000 ký tự",
    "DTNNC03": "Ý kiến phản hồi không được vượt quá 1000 ký tự",
    "DTNNC04": "Người nhận đơn không tồn tại trong hệ thống",
    "DTNNC05": "Đã hết thời gian phản hồi ý kiến",
    "DTNNC06": "Ý kiến phản hồi đã tồn tại",
    "DTNNC07": "Không thể gửi, trình hay xin ý kiến bản thân",
    "DTNNC08": "Chưa chọn file đính kèm.",

    "DTNPC02": "Ca nghỉ phép không hợp lệ",

    "DTNHC01": "Đơn từ nghỉ hưu không tồn tại hệ thông.",
    "DTNHC02": "Nơi cư trú sau nghĩ hưu không được vượt quá 500 ký tự.",
    "DTNHC03": "Nơi khám chữa bệnh không được vượt quá 500 ký tự.",
    "DTNHC04": "Ghi chú không được vượt quá 500 ký tự.",
    "DTNHC05": "Nơi nhận không được vượt quá 500 ký tự.",
    "DTNHC06": "Số thông báo không được vượt quá 100 ký tự.",
    "DTDTNHC01": "Đơn từ độ tuổi nghỉ hưu không tồn tại hệ thông.",
    "DTDTNHC02": "Ghi chú không được vượt quá 200 ký tự.",
    "PNNSC01": "Ghi chú không được vượt quá 500 ký tự",
    "DTPNC02": "Tên đối tượng không được vượt quá 50 ký tự.",
    "DTPNC03": "Ghi chú không được vượt quá 200 ký tự.",
  
    "KHTDC31": "Nhân sự không được để trống",
  
    "KHTDCTC08": "Tên người thực hiện vượt quá 500 ký tự.",
  
    "NSLC08": "Lý do không được bỏ trống",
    "QDC13": "Căn cứ quyết định số không được vượt quá 50 ký tự.",
    "QDC14": "Thành lập theo quyết định số vượt quá 50 ký tự.",
  
    "DTDXLC01": "Mã nhóm CDNN không được vượt quá 1000 ký tự.",
    "DTDXLC02": "Mã nhóm CDNN đề xuất không được vượt quá 1000 ký tự.",
    "DTDXLC03": "Ghi chú không được vượt quá 1000 ký tự.",
    "DTDXLC04": "Không thể tạo quyết định cho đơn từ chưa được duyệt.",
  
    "CDNNKHC01": "Kế hoạch chuyển chức danh nghề nghiệp không tồn tại trong hệ thống.",
    "CDNNKHC02": "Mã kế hoạch vượt quá 50 ký tự.",
    "CDNNKHC03": "Mã kế hoạch không được phép để trống.",
    "CDNNKHC04": "Tên kế hoạch không được phép để trống.",
    "CDNNKHC05": "Tên kế hoạch vượt quá 500 ký tự.",
    "CDNNKHC06": "Năm kế hoạch không được phép để trống.",
    "CDNNKHC07": "Ghi chú vượt quá 1000 ký tự.",
    "CDNNKHC08": "Kế hoạch không được phép chỉnh sửa.",
    "CDNNKHC09": "Ngày kết thúc nhỏ hơn ngày bắt đầu.",
    "CDNNKHC10": "Trạng thái kế hoạch không hợp lệ.",
    "CDNNKHC11": "Đăng ký kế hoạch không thành công.",
    "CDNNKHC12": "Kết thúc không thành công. Tất cả nhân sự được duyệt phải được ban hành quyết định.",
    "CDNNKHC13": "Mã kế hoạch đã tồn tại trong hệ thống.",
    "CDNNKHC14": "Kế hoạch đã hết hạn đăng ký.",
  
    "CDNNKHCTC01": "Chi tiết kế hoạch chuyển chức danh nghề nghiệp không tồn tại trong hệ thống.",
    "CDNNKHCTC02": "Hình thức chuyển chức danh nghề nghiệp vượt quá 500 ký tự.",
    "CDNNKHCTC03": "Kiến thức chung vượt quá 500 ký tự.",
    "CDNNKHCTC04": "Chuyên môn nghiệp vụ vượt quá 500 ký tự.",
    "CDNNKHCTC05": "Ghi chú hình thức kiểm tra vượt quá 500 ký tự.",
    "CDNNKHCTC06": "Ghi chú vượt quá 500 ký tự.",
    "CDNNKHCTC07": "Chức danh nghề nghiệp đã tồn tại trong kế hoạch.",
  
    "CDNNKHCTHSC01": "Hồ sơ không tồn tại trong hệ thống.",
    "CDNNKHCTHSC02": "Giấy tờ vượt quá 2000 ký tự.",
    "CDNNKHCTHSC03": "Ghi chú vượt quá 500 ký tự.",
  
    "CDNNKHHDC01": "Kế hoạch hội đồng không tồn tại trong hệ thống",
    "CDNNKHHDC02": "Chức vụ vượt quá 200 ký tự.",
    "CDNNKHHDC03": "Chức danh vượt quá 200 ký tự.",
    "CDNNKHHDC04": "Ghi chứ vượt quá 500 ký tự.",
    "CDNNKHHDC05": "Nhân sự đã tồn tại trong hội đồng.",
  
    "CDNNKHTTTDC01": "Tóm tắt kế hoạch không tồn tại trong hệ thống",
    "CDNNKHTTTDC02": "Nội dung công việc vượt quá 500 ký tự.",
    "CDNNKHTTTDC03": "Đơn vị phối hợp vượt quá 500 ký tự.",
    "CDNNKHTTTDC04": "Kết quả vượt quá 500 ký tự.",
    "CDNNKHTTTDC05": "Ghi chứ vượt quá 500 ký tự.",
  
    "CDNNDKCNC01": "Đăng ký chuyển chức danh nghề nghiệp không tồn tại trong hệ thống",
    "CDNNDKCNC02": "Ghi chú vượt quá 500 ký tự.",
    "CDNNDKCNC03": "Trạng thái đăng ký chuyển ngạch không hợp lệ.",
    "CDNNDKCNC04": "Không thể cập nhật phiếu đăng ký.",
    "CDNNDKCNC05": "Chưa chọn file đính kèm hồ sơ bắt buộc.",
  
    "CDNNKHYCGVC01": "Yêu cầu đối với giảng viên không tồn tại trong hệ thống.",
    "CDNNKHYCGVC02": "Ghi chú vượt quá 500 ký tự.",
  
    "CDNNDKCNDTC01": "Đề tài đăng ký chuyển chức danh nghề nghiệp không tồn tại trong hệ thống.",
    "CDNNDKCNDTC02": "Đề án nhiệm vụ vượt quá 2000 ký tự.",
    "CDNNDKCNDTC03": "Văn bản quản lý và điều hành cấp ĐHQGHN vượt quá 2000 ký tự.",
    "CDNNDKCNDTC04": "Văn bản quản lý và điều hành cấp Đơn vị vượt quá 2000 ký tự.",
    "CDNNDKCNDTC05": "Ghi chú vượt quá 500 ký tự.",
    "CDNNDKCNDTC06": "Chương trình nghiên cứu vượt quá 2000 ký tự.",
  
    "CDNNDKCNLSC01": "Nội dung vượt quá 1000 ký tự.",
    "CDNNDKCNLSC02": "Ghi chú vượt quá 500 ký tự.",
  
    "VTVLCQC01": "Mã vị trí việc làm cơ quan vượt quá 50 ký tự.",
    "VTVLCQC02": "Tên vị trí việc làm cơ quan vượt quá 500 ký tự.",
    "VTVLCQC03": "Ghi chú vượt quá 500 ký tự.",
    "VTVLCQC04": "Mô tả công việc vượt quá 500 ký tự",
    "VTVLCQC05": "Vị trí việc làm đã được thêm vào đề án.",
  
    "KNLC01": "Mã khung năng lực vượt quá 50 ký tự.",
    "KNLC02": "Tên khung năng lực vượt quá 500 ký tự.",
    "KNLC03": "Ghi chú vượt quá 500 ký tự.",
  
    "DBCQC01": "Số quyết định không được vượt quá 50 ký tự",
    "DBCQC02": "Ghi chú vượt quá 500 ký tự.",
    "DBCQC03": "Định biên cơ quan đã được tạo đề án.",
  
    "CTDBCQC01": "Ghi chú vượt quá 500 ký tự.",
  
    "ESYSCC01": "System Control không tồn tại trong hệ thống.",
    "ESYSCC02": "KeyControl vượt quá 20 ký tự.",
    "ESYSCC03": "Tiêu đề vượt quá 200 ký tự.",
    "ESYSCC04": "Mô tả vượt quá 100 ký tự.",
    "ESYSCC05": "KeyControl không được phép để trống.",
  
    "ESYSCDMC01": "System control danh mục không tồn tại trong hệ thống.",
    "ESYSCDMC02": "Tên vượt quá 200 ký tự.",
    "ESYSCDMC03": "Mô tả vượt quá 1000 ký tự.",
  
    "ESYSCDKC01": "System control điều kiện không tồn tại trong hệ thống.",
    "ESYSCDKC02": "KeyControl vượt quá 20 ký tự.",
    "ESYSCDKC03": "Giá trị không được phép để trống.",
  
    "ESYSCDTC01": "System control đối tượng không tồn tại trong hệ thống.",
  
    "DAC03" : "Đề án đã tồn tại"
}
